{
  "tonkotsu_ramen": {
    "name": "tonkotsu_ramen",
    "source": "https://norecipes.com/tonkotsu-ramen-recipe/",
    "banner": "https://i.imgur.com/ZYoH36f.jpg",
    "prepTime": 15,
    "cookTime": 165,
    "makes": "alot",
    "ingredients": [
      "fresh ramen noodles",
      "sliced chashu",
      "2 scallions finely chopped"
    ],
    "components": [
      {
        "name": "soup",
        "ingredients": [
          "1 tablespoon tahini",
          "1 tablespoon strained braising liquid from chashu",
          "2 cloves garlic finely grated (not pressed)",
          "1 - 2 teaspoons kosher salt (to taste)",
          "1 teaspoon mirin",
          "1/8 teaspoon ground white pepper",
          "1 tablespoon toasted sesame seeds coarsely ground",
          "2 tablespoons fatback finely minced (salted pork fat)"
        ],
        "components": [
          {
            "name": "tonkotsu_base",
            "needed": "3 cups",
            "makes": "10-12 cups of stock",
            "components": [],
            "ingredients": [
              "2 pig trotters (cut in half lengthwise)",
              "1.5 pounds pork leg bone (cut into several pieces)",
              "1.5 pounds chicken bones",
              "2 inch knob fresh ginger (sliced thin)",
              "1 small head garlic (trimmed but whole)",
              "1 large onion (sliced thinly)",
              "1 teaspoon white peppercorns"
            ],
            "directions": [
              "Fill a pressure cooker 2/3rds of the way with water and bring to a boil. Add the pig trotters to the boiling water and cook until you stop seeing red blood come out of the bones (about 10-15 minutes). The idea is to draw out as much of the gunk as possible into this first batch of water. Transfer the trotters to a bowl of cold water then repeat with the leg bones and chicken bones (you can use the same water).",
              "Dump the now very dirty water down the drain and wash the pot. Scrub any dark brown scrum off all the bones and rinse them thoroughly. Return the cleaned bones to the pot and cover with water (the water should come up an inch above the top of the bones). Bring the pot to a boil and skim off any chunks or foam that floats to the surface. Keep doing this until you don't seen any more foam or scum floating up. This will take about 30 minutes.",
              "While the bones are going, Heat 1/2\" of oil in a pot over medium heat and add the head of garlic and ginger. Fry this until they are browned and shriveled up. Use a slotted or wire mesh to transfer the ginger and garlic to a bowl. Add the onions to the oil and fry these until caramelized and shriveled. Add the fried onions to the ginger and garlic and set aside.",
              "Once the stock is scum-free, add the caramelized ginger, garlic, and onions, along with the white pepper to the stock. Affix the pressure cooker lid and cook on high pressure for 1 hour and 45 minutes. If you don't have a pressure cooker, cover with a lid and cook at a boil for 5-6 hours (you may need to check and add water periodically, the bones should be mostly covered in water).",
              "Once the pressure is released use tongs to remove and discard all the bones. Remove any chunks of pork and set aside for another use. Strain the stock into a bowl and skim off any excess fat."
            ]
          }
        ],
        "directions": [
          "Heat the tonkotsu base in a sauce pan. In a bowl whisk together the tahini, chashu liquid, grated garlic, salt, mirin and white pepper. Add this to the hot broth and whisk to combine. Taste and adjust salt as needed. Bring to a simmer, then add the sesame seeds and pork fat and whisk to combine."
        ]
      },
      {
        "name": "mayu",
        "makes": "some",
        "ingredients": [
          "1/4 cup toasted sesame oil",
          "5 cloves garlic grated"
        ],
        "components": [],
        "directions": [
          "To make the black garlic oil, add the sesame oil into a small saucepan along with the grated garlic. Put the pan over medium low heat and let the garlic cook stirring occasionally until it is very dark brown. When the garlic is very dark, turn the heat down to low and let it cook until it is black.",
          "As soon as it hits black, turn off the heat and transfer the hot oil and garlic to a heatproof bowl. Let this mixture cool down completely. Add the cooled oil to a blender or food processor and blitz until there are no visible garlic particles left and the oil is uniformly black.",
          "It will taste burnt and slightly bitter, but this is okay as you only add a little bit to each bowl. Put it the oil in a container and refrigerate until you are ready to use it."
        ]
      }
    ],
    "directions": ["Split the cooked noodles between two bowls. Pour the tonkotsu soup over the noodles. Top with chashu, scallions and whatever else you want to add. Finish the ramen with a drizzle of mayu on each bowl."],
    "notes": [
      "To get the creamy white soup it’s important that you use pork leg bones and the trotters. The white color comes from the marrow and collagen in these parts. Using other types of pork bones such as ribs or neck bones will not give your soup the richness or color.",
      "Don’t omit the fatback (salted pork fat). Most of the fat from the stock gets skimmed out, and the fat added at the last minute is what gives the soup it’s rich “sticky” quality. By whisking small bits of minced fatback in at the end, you create an emulsion of soup and fat, so it makes the soup nice and creamy without being greasy. If you’re having a hard time finding it, try asking for it at a butcher.",
      "The onions should be a deep brown, but they should not be burnt, if they are browning unevenly, turn the heat down, so they brown more slowly.",
      "Tahini is not the same as toasted sesame paste. It should be light beige in color and have a thick pourable consistency. If your grocery store doesn’t carry it, try finding a Middle Eastern or Indian grocery store. I use a brand called “Al Wadi” that comes in a plastic container with a green label and lid and has a relatively mellow flavor. If you can’t get tahini you can also grind your own sesame seeds until you have something resembling runny peanut butter.",
      "Salt has different levels of salinity depending on the type and brand. Even amongst kosher salt, Morton’s for example is much more salty than Diamond Crystal (which I use). Most recipes deliberately go low on the amount of salt you should use so you don’t accidentally over salt your dish. If you feel like it needs more salt, by all means, add more salt."
    ]
  },
  "teriyaki_chicken": {}
}